# WorksharingSaveAsOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingSaveAsOptions Constructor
WorksharingSaveAsOptions Class See Also
---
Constructs a new WorksharingSaveAsOptions with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public WorksharingSaveAsOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WorksharingSaveAsOptions()
```

# See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace